# ალგორითმი არის ისეთი რაღაც მაგალითად დავალება რომელსაც ნაბიჯ-ნაბიჯ უნდა შევასრულოთ ამას ეწოდება ალგორითმი 
#  ერთი ცხოვრებისსეული მაგალითი , წარმოიდგინე რომ რაომელიმე კერძის მომზადება გსურს
# აიღე ქვაბი 
# ჩაასხი სასურველი რაოდენობის წყალი
# შემდეგ ჩაყარე მაგალითდ ხორცი კარტოფილი სტაფილო და ა.შ
# შემდეგ დაელოდე რომ მომზადდეს

# iteration (იტერაცია) ნიშნავს მოქმედების გამეორებას გარკვეული რაოდენობით ან პირობამდე.
# მაგალითად, თვლი 1-დან 5-მდე:

#sequencing ნიშნავს რომ კოდი სრულდება თანმიმდევრობით

#selection არის ამორჩევა



age = 15

if age >= 18:
    print("You are an adult")
else:
    print("You are a kid")